Revit 2025 API
Zone.GrossArea Property
Get the Gross Area of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double GrossArea { get; }
Public ReadOnly Property GrossArea As Double
	Get
public:
property double GrossArea {
	double get ();
}
member GrossArea : float with get
Property Value
Double
Remarks
This property is used to get the Gross Area of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace